-- phpMyAdmin SQL Dump
-- version 4.4.15.5
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2016-06-19 15:31:31
-- 服务器版本： 5.5.47
-- PHP Version: 7.0.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `think5`
--

-- --------------------------------------------------------

--
-- 表的结构 `cy_auth_rule`
--

CREATE TABLE IF NOT EXISTS `cy_auth_rule` (
  `id` mediumint(8) unsigned NOT NULL,
  `pid` mediumint(8) unsigned NOT NULL DEFAULT '0' COMMENT '父级id',
  `name` char(80) NOT NULL DEFAULT '',
  `title` char(20) NOT NULL DEFAULT '',
  `url` char(255) DEFAULT NULL COMMENT 'url地址，默认为null，当为null时使用方法调用name',
  `condition` char(100) NOT NULL DEFAULT '',
  `controller` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否是控制器，0不是，1是',
  `instantiation` tinyint(1) NOT NULL DEFAULT '0' COMMENT '是否需要实例化，0为不需要，1为需要',
  `auth` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否需要权限验证，1为需要，0为不需要',
  `type` tinyint(1) NOT NULL DEFAULT '1',
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '状态，1为正常，0为禁用',
  `isnavshow` tinyint(1) NOT NULL DEFAULT '1' COMMENT '是否显示导航，0为隐藏，1为显示',
  `icon` char(40) NOT NULL COMMENT '图标',
  `sort` smallint(6) NOT NULL DEFAULT '100' COMMENT '排序，越大越往后',
  `create_time` int(11) NOT NULL COMMENT '添加时间',
  `update_time` int(11) NOT NULL COMMENT '修改时间'
) ENGINE=InnoDB AUTO_INCREMENT=290 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC;

--
-- 转存表中的数据 `cy_auth_rule`
--

INSERT INTO `cy_auth_rule` (`id`, `pid`, `name`, `title`, `url`, `condition`, `controller`, `instantiation`, `auth`, `type`, `status`, `isnavshow`, `icon`, `sort`, `create_time`, `update_time`) VALUES
(1, 0, 'index', '控制台', 'index/index', '', 1, 0, 0, 1, 1, 1, 'fa-home', 0, 0, 1466260260),
(2, 0, 'Product', '产品管理', NULL, '', 1, 1, 1, 1, 1, 0, 'fa-product-hunt', 100, 0, 1464090970),
(3, 0, 'order', '订单管理', NULL, '', 1, 0, 1, 1, 1, 0, 'fa-home', 100, 0, 1464090980),
(4, 0, 'Business', '商家管理', NULL, '', 1, 1, 1, 1, 1, 0, 'fa-reorder', 100, 0, 0),
(5, 0, 'Content', '内容管理', NULL, '', 0, 1, 1, 1, 1, 0, 'fa-list-alt', 100, 0, 1464090964),
(6, 0, 'Member', '会员管理', NULL, '', 1, 1, 1, 1, 1, 0, 'fa-home', 100, 0, 1464090947),
(7, 0, 'auth', '权限管理', 'authRule/index', '', 0, 0, 1, 1, 1, 1, 'fa-random', 100, 0, 1464352426),
(8, 0, 'System', '系统管理', '', '', 0, 0, 1, 1, 1, 1, 'fa-gears', 101, 0, 1464872339),
(21, 2, 'product/list', '产品管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1463324726),
(22, 2, 'Examine', '审核管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(23, 21, 'Scenery', '旅游线路管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1463324763),
(24, 21, 'Hotel', '酒店管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1463324772),
(25, 21, 'Travelticket', '景区门票', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1463324777),
(26, 21, 'Group', '休闲美食', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1463324787),
(27, 1, 'index/index', '控制台首页', NULL, '', 0, 0, 0, 1, 1, 1, '', 99, 0, 1463325041),
(28, 22, 'Hotel/hotelListt', '酒店审核', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(29, 22, 'TravelTicket/ticketListt', '景区门票审核', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(30, 22, 'Group/indexx', '美食审核', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(31, 3, 'order/index', '旅游路线订单列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(32, 31, 'order/index2', '酒店订单列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(33, 3, 'order/index3', '景区门票订单列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(34, 33, 'order/index4', '休闲美食订单列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(35, 33, 'order/index5', '旅游路线订单列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(52, 5, 'Message', '留言管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(53, 5, 'Message/messagelist', '留言列表', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 0),
(54, 5, 'Ad', '广告管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(61, 6, 'Member/mg', '会员设置', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 1463666413),
(62, 61, 'Member/index', '会员列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(71, 7, 'manager/index', '管理员管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(72, 7, 'authRule/index', '规则管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1462501796),
(73, 72, 'authRule/list', '规则列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1462499019),
(74, 72, 'authRule/add', '添加规则', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1462501823),
(75, 72, 'authRule/edit', '编辑规则', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 1462703587),
(76, 72, 'authRule/del', '删除规则', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 1463664638),
(77, 71, 'manager/list', '管理员列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(78, 71, 'manager/add', '添加管理员', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1463210795),
(79, 71, 'Manager/edit', '编辑管理员', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 0),
(80, 71, 'manager/log', '管理员日志', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1462807107),
(81, 8, 'cache/index', '缓存管理', NULL, '', 1, 0, 1, 1, 1, 1, '', 100, 0, 1448439593),
(82, 8, 'MobileCode', '短信管理', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 1464091058),
(83, 8, 'Backup', '数据库管理', NULL, '', 1, 0, 1, 1, 1, 1, '', 100, 0, 1448439961),
(84, 81, 'cache/cache', '更新缓存', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(85, 8, 'Visitcount', '访问统计', NULL, '', 1, 1, 1, 1, 1, 0, '', 100, 0, 1464091046),
(86, 85, 'Visitcount/index', '访问概况', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(87, 85, 'Visitcount/today', '今日访问排行', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(88, 8, 'Pay', '支付设置', NULL, '', 1, 0, 1, 1, 1, 0, '', 100, 0, 1464091070),
(91, 0, 'Other', '未归类', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 1448010613, 1448021414),
(101, 7, 'authGroup/index', '角色管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1463295248),
(102, 101, 'AuthGroup/add', '角色添加', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1462695304),
(103, 101, 'AuthGroup/edit', '角色编辑', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 0),
(104, 101, 'AuthGroup/del', '角色删除', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 0),
(105, 101, 'AuthGroup/rule', '分配权限', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 1463295488),
(106, 85, 'Visitcount/latest', '实时访客', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(107, 7, 'action/index', '行为管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(108, 107, 'action/list', '用户行为', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 0),
(109, 107, 'action', '行为管理控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 0, 1466349503),
(110, 107, 'actionLog/list', '行为日志', NULL, '', 0, 0, 1, 1, 1, 1, '', 101, 1448348339, 1462807148),
(111, 88, 'Pay/chinabanck', '网银在线设置', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 1448348382, 0),
(112, 1, 'index/index111', '首页控制器', NULL, '', 0, 0, 0, 1, 1, 0, '', 100, 1448369860, 1464618135),
(113, 1, 'index/copyright', '系统信息', NULL, '', 0, 0, 0, 1, 1, 1, '', 100, 1448369952, 1464270431),
(114, 83, 'Backup/index', '数据库', NULL, '', 0, 1, 1, 1, 1, 1, '', 100, 1448437926, 1448437978),
(115, 81, 'cache/update', '更新缓存操作', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 1448439236, 1463209728),
(116, 1, 'manager/info', '修改个人信息', NULL, '', 0, 0, 0, 1, 1, 1, '', 100, 1448593741, 1464270365),
(117, 1, 'manager/password', '修改密码', NULL, '', 0, 0, 0, 1, 1, 1, '', 100, 1448594855, 1464270384),
(118, 71, 'ManagerActionLog', '管理员日志控制器', NULL, '', 1, 1, 1, 1, 1, 0, '', 100, 1450409832, 1450409935),
(119, 1, 'ManagerActionLog/index', '管理员日志121', '', '', 1, 0, 1, 1, 1, 0, '', 100, 1450409970, 1466255842),
(152, 107, 'action/add', '添加行为', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 0, 1462705905),
(153, 107, 'action/edit', '修改行为', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 0, 1462727351),
(204, 101, 'authGroup/list', '角色列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 99, 1462695390, 1462702804),
(218, 71, 'manager/disable', '禁用用户', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 1463234283, 0),
(219, 72, 'authRule/updateshow', '设置是否在控制台菜单显示', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 1463288822, 1463664833),
(220, 72, 'authRule/updateauth', '设置验证状态', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 1463289399, 1463664807),
(221, 8, 'category/index', '类别管理', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 1463657943, 1463664211),
(222, 221, 'category', '类别管理控制器', NULL, '', 1, 1, 1, 1, 1, 0, '', 100, 1463658455, 1463928165),
(223, 221, 'category/list', '类别列表', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 1463659472, 1464015124),
(224, 221, 'category/add', '添加类别', NULL, '', 0, 0, 1, 1, 1, 1, '', 100, 1463662072, 1463928396),
(225, 72, 'authRule/disable', '设置规则状态', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 1463664692, 1463664692),
(226, 221, 'category/edit', '编辑类别', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 1463664960, 1463928439),
(227, 221, 'category/status', '设置类别状态', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 1463666434, 1464015335),
(228, 221, 'category/updateshow', '设置类别显示状态', NULL, '', 0, 0, 1, 1, 1, 0, '', 100, 1463928513, 1464015321),
(229, 8, 'developer/index', '开发管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464406829, 1464406829),
(230, 229, 'developer', '开发管理控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1464406877, 1464406877),
(231, 229, 'developer/list', '开发日志列表', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464406930, 1464410819),
(232, 229, 'developer/add', '添加开发日志', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464406968, 1464406968),
(233, 229, 'developer/edit', '编辑开发日志', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1464406994, 1464406994),
(234, 229, 'developer/view', '查看开发日志', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1464410488, 1464410488),
(235, 0, 'app/index', '应用管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464871706, 1464871706),
(236, 235, 'app', '应用管理控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1464871925, 1464871925),
(237, 235, 'app/list', '应用列表', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464872476, 1464872476),
(238, 235, 'app/add', '添加应用', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464872491, 1464872491),
(239, 235, 'app/edit', '编辑应用', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1464872528, 1464872711),
(240, 235, 'app/updatestatus', '更新应用状态', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1464872689, 1464872689),
(241, 0, 'dot/index', '丽堡站点管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464954420, 1465743340),
(242, 241, 'dotMenu/index', '菜单管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464955794, 1464955794),
(243, 242, 'dotMenu', '菜单管理控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1464955842, 1464955842),
(244, 242, 'dotMenu/list', '菜单列表', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464955909, 1464955909),
(245, 242, 'dotMenu/add', '添加菜单', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464955953, 1464955953),
(246, 242, 'dotMenu/edit', '编辑菜单', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1464956182, 1464956248),
(247, 241, 'dotCategory/index', '类别管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464957069, 1464957069),
(248, 247, 'dotCategory', '类别管理控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1464957129, 1464957129),
(249, 247, 'dotCategory/list', '类别列表', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464957175, 1464957175),
(250, 247, 'dotCategory/add', '添加类别', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464957208, 1464957208),
(251, 247, 'dotCategory/edit', '编辑类别', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1464957306, 1464957306),
(252, 241, 'dotCases/index', '成功案例管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464957377, 1464957377),
(253, 252, 'dotCases', '成功案例控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1464957416, 1464957416),
(254, 252, 'dotCases/list', '成功案例列表', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464957447, 1464957447),
(255, 252, 'dotCases/add', '添加成功案例', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1464957469, 1464957469),
(256, 252, 'dotCases/edit', '编辑成功案例', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1464957544, 1464957586),
(257, 241, 'dotWebinfo/index', '网站管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1465118599, 1465143553),
(258, 257, 'dotWebinfo', '网站信息管理控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1465118637, 1465118637),
(259, 257, 'dotWebinfo/edit', '网站设置', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1465118687, 1465143577),
(260, 257, 'dotWebinfo/link', '联系我们设置', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1465143721, 1465143721),
(261, 257, 'dotWebinfo/about', '关于我们', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1465144287, 1465144287),
(262, 241, 'dotArticle/index', '内容管理', '', '', 0, 0, 1, 1, 1, 1, '', 99, 1465212868, 1465212868),
(263, 262, 'dotArticle', '内容管理控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1465212901, 1465212901),
(264, 262, 'dotArticle/list', '内容列表', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1465212921, 1465212921),
(265, 262, 'dotArticle/add', '内容添加', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1465212939, 1465212939),
(266, 262, 'dotArticle/edit', '内容编辑', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1465212957, 1465212957),
(267, 247, 'dotCategory/updatestatus', '更新类别状态', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1465823733, 1465823733),
(268, 247, 'dotCategory/updatehidden', '更新类别显示状态', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1465823764, 1465823764),
(269, 0, 'extend', '扩展管理', 'addons/index', '', 0, 0, 1, 1, 1, 1, '', 100, 1466228657, 1466228992),
(270, 269, 'addons/index', '插件管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1466228888, 1466228888),
(271, 270, 'addons', '插件控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1466229048, 1466229048),
(272, 270, 'addons/list', '插件列表', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1466229201, 1466229463),
(273, 270, 'addons/config', '插件设置', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1466229491, 1466229491),
(274, 269, 'hooks/index', '钩子管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1466229568, 1466229568),
(275, 274, 'hooks', '钩子控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1466229607, 1466229607),
(276, 274, 'hooks/list', '钩子列表', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1466230007, 1466230007),
(277, 274, 'hooks/add', '钩子添加', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1466231186, 1466231186),
(278, 274, 'hooks/edit', '钩子编辑', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1466231194, 1466231232),
(279, 71, 'manager', '管理员控制器', '', '', 1, 1, 1, 1, 1, 0, '', 0, 1466309256, 1466309256),
(280, 72, 'authRule', '规则管理控制器', '', '', 1, 1, 1, 1, 1, 0, '', 0, 1466309532, 1466309532),
(281, 101, 'authGroup', '角色管理控制器', '', '', 1, 1, 1, 1, 1, 1, '', 0, 1466309578, 1466309578),
(282, 8, 'config/index', '网站设置', 'config/index?id=1', '', 0, 0, 1, 1, 1, 1, '', 100, 1466310323, 1466313201),
(283, 284, 'config', '网站设置控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1466310459, 1466313070),
(284, 8, 'config/list', '配置管理', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1466311812, 1466311812),
(285, 284, 'config/add', '添加配置', '', '', 0, 0, 1, 1, 1, 1, '', 100, 1466311991, 1466311991),
(286, 284, 'config/edit', '编辑配置', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1466312050, 1466312064),
(287, 284, 'config/del', '删除配置', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1466312086, 1466312118),
(288, 284, 'config/sort', '排序配置', '', '', 0, 0, 1, 1, 1, 0, '', 100, 1466312110, 1466312110),
(289, 110, 'actionLog', '日志控制器', '', '', 1, 1, 1, 1, 1, 0, '', 100, 1466350259, 1466350259);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cy_auth_rule`
--
ALTER TABLE `cy_auth_rule`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `cy_auth_rule`
--
ALTER TABLE `cy_auth_rule`
  MODIFY `id` mediumint(8) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=290;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
